Revit 2027 API
FabricationService.GetButton Method
 Gets the service button for a given palette index and button index from the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationServiceButton GetButton(
	int paletteIndex,
	int buttonIndex
)
Public Function GetButton (
	paletteIndex As Integer,
	buttonIndex As Integer
) As FabricationServiceButton
public:
FabricationServiceButton^ GetButton(
	int paletteIndex,
	int buttonIndex
)
member GetButton :
        paletteIndex : int *
        buttonIndex : int -> FabricationServiceButton
Parameters
paletteIndex Int32
 The palette index.
buttonIndex Int32
 The button index.
Return Value
FabricationServiceButton
 The service button.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index paletteIndex is not larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace